# 1. Работа с данными

In [1]:
import pandas as pd
import numpy as np
import math
from scipy import stats as st
import matplotlib.pyplot as plt
import seaborn
import warnings
warnings.filterwarnings('ignore')

In [2]:
groups= pd.read_csv('https://raw.githubusercontent.com/maxikos8/-/main/groups.csv', sep=';')
checks =pd.read_csv('https://raw.githubusercontent.com/maxikos8/-/main/checks.csv', sep=';')
active = pd.read_csv('https://raw.githubusercontent.com/maxikos8/-/main/active_studs.csv',sep=';')

In [3]:
groups.columns=['student_id','group']
groups.sample(10)

       student_id group
70716     1153245     B
46968     5222161     B
56046     3964059     B
35581     2515035     B
71865      510087     A
15726      727507     A
61762     5604738     B
72970      178008     B
34089      243243     B
43007     4717010     B

In [4]:
groups['group'].value_counts(normalize=True)

B    0.80298
A    0.19702
Name: group, dtype: float64

In [5]:
groups.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74576 entries, 0 to 74575
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  74576 non-null  int64
 1   group       74576 non-null  object
dtypes: int64(1), object(1)
memory usage: 1.1+ MB

In [6]:
checks.sample(10)

     student_id     rev
481     4935152   290.0
473     4868317   990.0
499     5182220   580.0
236     1783273  1900.0
19       226909  1140.0
357     3354373   870.0
389     3806942   290.0
411     4038035   199.0
58       387124   690.0
476     4907380   590.0

In [7]:
checks['student_id'].nunique()

541

In [8]:
checks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541 entries, 0 to 540
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  541 non-null    int64
 1   rev         541 non-null    float64
dtypes: float64(1), int64(1)
memory usage: 8.6 KB

In [9]:
active.sample(10)

      student_id
6862     1867464
5411      972038
2251     4009814
4617     1115829
6960     2883722
5801      675008
340      1134649
7535     5728431
6732     5509941
2797     3273912

In [10]:
active.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8341 entries, 0 to 8340
Data columns (total 1 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  8341 non-null   int64
dtypes: int64(1)
memory usage: 65.3 KB

In [11]:
active = pd.merge(active,groups,on='student_id')

In [12]:
checks = pd.merge(checks,groups,on='student_id')

In [13]:
df = pd.merge(checks,active,on=['student_id','group'],how='outer')

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8490 entries, 0 to 8489
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  8490 non-null   int64
 1   rev         541 non-null    float64
 2   group       8490 non-null   object
dtypes: float64(1), int64(1), object(1)
memory usage: 265.3+ KB

In [15]:
df['group'].value_counts(normalize=True)

B    0.81543
A    0.18457
Name: group, dtype: float64

In [16]:
len(checks['student_id'].unique())

541

In [17]:
df_rev = df.loc[~df['rev'].isna()]

In [18]:
df_rev.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 541 entries, 0 to 540
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  541 non-null    int64
 1   rev         541 non-null    float64
 2   group       541 non-null    object
dtypes: float64(1), int64(1), object(1)
memory usage: 16.9+ KB

In [19]:
df_rev.head()

   student_id    rev group
0        1627  990.0     A
1        3185  690.0     B
2       25973  690.0     B
3       26280  690.0     B
4      100300  990.0     B

In [29]:
df_rev['group'].value_counts()

B    434
A    107
Name: group, dtype: int64

In [20]:
df_rev['group'].value_counts(normalize=True)

B    0.802218
A    0.197782
Name: group, dtype: float64

Конверсия

ARPU(средний доход, который получаем от каждого активного пользователя)

In [33]:
df['rev'].sum() / df.shape[0]

67.5295646171967

 ARPPYU(средний доход получаемы от каждого платящего клиента за этот период)

In [31]:
df_rev['rev'].mean()

1059.7523171903883

paying share(это ARPU / ARPPu)

In [35]:
(df['rev'].sum() / df.shape[0]) / df_rev['rev'].mean() *100

6.3722025912838625

In [28]:
df_rev.groupby('group').agg({'rev':['sum','mean']})

               rev
               sum         mean
group
A       92096.0000   860.710280
B      481230.0036  1108.824893

In [36]:
active

      student_id group
0         581585     A
1        5723133     A
2        3276743     B
3        4238589     A
4        4475369     B
...          ...   ...
8336     1794344     B
8337      296883     B
8338     3598448     B
8339     3610547     B
8340      205705     B

[8341 rows x 2 columns]

In [37]:
checks

     student_id     rev group
0          1627   990.0     A
1          3185   690.0     B
2         25973   690.0     B
3         26280   690.0     B
4        100300   990.0     B
..          ...     ...   ...
536     5645737  1900.0     B
537     5651566  1900.0     B
538     5662322  1900.0     B
539     5681918  1900.0     B
540     5740903  1900.0     B

[541 rows x 3 columns]

In [44]:
checks_a = checks.query('group == "A"')
checks_b = checks.query('group == "B"')

In [45]:
checks_a.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 107 entries, 0 to 532
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  107 non-null    int64
 1   rev         107 non-null    float64
 2   group       107 non-null    object
dtypes: float64(1), int64(1), object(1)
memory usage: 3.3+ KB

In [51]:
checks_b.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 434 entries, 1 to 540
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  434 non-null    int64
 1   rev         434 non-null    float64
 2   group       434 non-null    object
dtypes: float64(1), int64(1), object(1)
memory usage: 13.6+ KB

In [47]:
test_a = pd.merge(checks_a,active,on='student_id')
test_a

    student_id     rev group_x group_y
0         1627   990.0       A       A
1       287008  1830.0       A       A
2       332387  2910.0       A       A
3       347455  2820.0       A       A
4       445767  3660.0       A       A
..         ...     ...     ...     ...
73     5394575   990.0       A       A
74     5545563  1160.0       A       A
75     5557468   290.0       A       A
76     5567520   489.0       A       A
77     5577840   590.0       A       A

[78 rows x 4 columns]

In [50]:
test_b = pd.merge(checks_b,active,on='student_id')
test_b

     student_id        rev group_x group_y
0        100300   990.0000       B       B
1        108270   290.0000       B       B
2        264473  1900.0001       B       B
3        274352   690.0000       B       B
4        280036   199.0000       B       B
..          ...        ...     ...     ...
309     5645737  1900.0000       B       B
310     5651566  1900.0000       B       B
311     5662322  1900.0000       B       B
312     5681918  1900.0000       B       B
313     5740903  1900.0000       B       B

[314 rows x 4 columns]

In [53]:
len(active['student_id'].unique())

8341

In [54]:
pay_tips = checks.merge(active,on='student_id',how='left')

In [56]:
pay_tips.loc[pay_tips['group_y'].isna()]

     student_id     rev group_x group_y
1          3185   690.0       B     NaN
2         25973   690.0       B     NaN
3         26280   690.0       B     NaN
5        100645   630.0       B     NaN
6        102534   580.0       B     NaN
..          ...     ...     ...     ...
508     5291900   199.0       B     NaN
512     5331842   290.0       B     NaN
521     5486319   199.0       B     NaN
530     5562806   398.0       B     NaN
534     5599663  1900.0       B     NaN

[149 rows x 4 columns]

# 2. Проверка гипотез